#+TITLE: Tables, Views, Functions
#+PROPERTY: header-args:sql-mode :product postgres :noweb yes :comments no :results silent

* Scratch
#+begin_src sql-mode
select * from generate_latest_coverage_json();
#+end_src

   #+begin_src sql-mode :results replace
     create or replace view new_endpoints as
     select first_release as release, array_agg(endpoint) as endpoints from (
       select distinct endpoint,
                       (array_agg(oa.release order by oa.release::semver))[1] as first_release
         from open_api oa
        group by endpoint, level, k8s_kind, k8s_action
     ) a
      group by first_release
      order by first_release::semver;
   #+end_src

   #+RESULTS:
   #+begin_SRC example
   CREATE VIEW
   #+end_SRC

#+begin_src sql-mode
  begin;
  \t
    \a
    \o ../resources/coverage/new-endpoints.json
    select json_agg(ne) from
    (
      select * from new_endpoints
      ) ne;
    \o
    \a
    \t
    commit;

#+end_src

#+BEGIN_SRC sql-mode
select count(*) from conformance.ineligible_endpoint;
#+END_SRC

#+BEGIN_SRC shell
wc -l ../resources/untested-endpoints.txt
#+END_SRC

#+RESULTS:
#+BEGIN_example
0 ../resources/untested-endpoints.txt
#+END_example
